<template>
    <div>
        <p><strong>Tanda organizer</strong> (организатор танд) – программа предназначена для сортировки танд и музыкальных композиций с последующим экспортом в виде упорядоченного пронумерованного списка файлов.</p>
        <ol>
            <li><p>Для добавления в программу музыкальных композиций нажмите кнопку <strong>Импорт</strong> и выберите папку, в которой хранится вся необходимая музыка. Будут импортированы все файлы из указанной папки и её подпапок. Каждая подпапка будет организована в виде отдельной карточки-танды.</p>
            </li>
            <li><p>Чтобы добавить дополнительные музыкальные композиции, нажмите кнопку <strong>Добавить</strong> и выберите папку с музыкой. Новые файлы будут добавлены в конец списка.</p>
            </li>
            <li><p>При необходимости, в программе можно создать пустую карточку-танду. Для этого нажмите кнопку <strong>Создать танду</strong>.</p>
            </li>
            <li><p>Если ваши файлы и папки имеют нумерацию, от которой вы хотите быстро избавиться, нажмите кнопку <strong>Очистить номера</strong> – будут удалены любые цифры и другие знаки в начале названия карточек-танд и музыкальных композиций.</p>
            </li>
            <li><p>Для изменения порядка карточек-танд зажмите левую кнопку мыши на заголовке танды и перетащите карточку в нужное вам место. Или кликните по заголовку правой кнопкой мыши, в появившемся меню выберите номер танды, которой она должна быть, и нажмите соответствующую номеру кнопку.</p>
            </li>
            <li><p>Для изменения порядка музыкальных композиций, зажмите левую кнопку мыши на мелодии и перетащите её в нужно место (внутри танды или в другую танду).</p>
            </li>
            <li><p>Для перемещения мелодии в другую танду можно использовать метод, описанный в <em>пункте 6</em>. Или кликните по мелодии правой кнопкой мыши, в появившемся меню выберите номер танды, в которую следует переместить мелодию – она будет добавлена в конец выбранной танды.</p>
            </li>
            <li><p>Для удаления из программы танды или мелодии, следует кликнуть правой кнопкой мыши по заголовку танды или по мелодии. В появившемся меню выберите пункт <strong>Убрать</strong>.</p>
            </li>
            <li><p>Для проигрывания мелодии в системном медиапроигрывателе кликните по мелодии правой кнопкой мыши и в появившемся меню выберите <strong>Открыть</strong>.</p>
            </li>
            <li><p>Для экспорта получившейся милонги нажмите кнопку <strong>Экспорт списком</strong> и выберите пустую папку, в которую будут сохранены файлы. Файлы будут экспортированы согласно порядку, указанному в программе. Например, _052<em>La estancia</em>. Первые две цифры (05) – номер танды, последняя цифра (2) – номер композиции в танде. Т.е. 5-ая танда и 2-ая мелодия в ней.</p>
            </li>
        </ol>
        <p>Вы можете регулировать размер окна программы, потянув за её края, свернуть или развернуть на полный экран.</p>
        <p>Важно понимать, что оригиналы файлов, которые вы добавляете в программу <strong>никак не затрагиваются</strong>. И все манипуляции, которые вы проводите внутри программы с файлами (удаляете номера, меняете порядок, создаете новые папки и т.п.) происходит только внутри программы, оригиналы не будут изменены.</p>
        <p>При закрытии программы она загружается пустой и инструкцией, как сейчас. Предыдущие сеансы не сохраняются.</p>
        <p>Разработчик: <a href="https://github.com/n-osennij/tanda-organizer" target="_blank">Никита Осенний</a>, Минск. <br>
            Версия программы: <a href="https://github.com/n-osennij/tanda-organizer/releases">1.0</a> от 08.10.2024 г.
        </p>
    </div>
</template>

<script>
export default {
   name: 'About'
};
</script>

<style scoped>

</style>
